// Дано число больше 9. Вывести на экран вторую цифру числа с конца. 
//Не нужно добавлять условия на проверку числа, которое должно быть более 9, так как это условие задачи,. и программа будет писаться под данные условия.

int a=15;
System.Console.WriteLine(a/10%10);

